In [1]:
import pandas as pd
import numpy as np

In [3]:
#allows you to group together rows based off a column and perform an aggregate function on them 
#aggregate func (any function that takes a lsit of items and spits off a single value -. Sum mean, etc )

data = {"company":["Google","Google", "MSFT", "MSFT", "FB", "FB"], "Persons": ["Berkat", "Adam", "Joe", "Femi", "George", "Sarah"], "Sales": [200,300,400,500,600,700]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

  company Persons  Sales
0  Google  Berkat    200
1  Google    Adam    300
2    MSFT     Joe    400
3    MSFT    Femi    500
4      FB  George    600
5      FB   Sarah    700

In [7]:
by_company = df.groupby("company")

In [12]:
by_company.count()

         Persons  Sales
company
FB             2      2
Google         2      2
MSFT           2      2

In [23]:
#using the desciptyion on the group by 
Data_result = df.groupby("company").describe().transpose()

In [25]:
Data_result

company              FB      Google        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   650.000000  250.000000  450.000000
      std     70.710678   70.710678   70.710678
      min    600.000000  200.000000  400.000000
      25%    625.000000  225.000000  425.000000
      50%    650.000000  250.000000  450.000000
      75%    675.000000  275.000000  475.000000
      max    700.000000  300.000000  500.000000

In [28]:
Data_result["FB"]

Sales  count      2.000000
       mean     650.000000
       std       70.710678
       min      600.000000
       25%      625.000000
       50%      650.000000
       75%      675.000000
       max      700.000000
Name: FB, dtype: float64